#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                             НАСТРОЙКИ БИБЛИОТЕК, ПРОЦЕССОВ, МЕТОДОВ, ФУНКЦИЙ
// глобальные определения
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

#ifndef STASSID
#define STASSID "xxxxxx" // "TP-LINK_70CCF2"
#define STAPSK "xxxxxxx" //"19598932"
#endif

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
// КОНСТАНТЫ
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

const char *ssid = STASSID;                  // имя сети WIFI
const char *pass = STAPSK;                   // пароль сети WIFI
const char *ntpServerName = "time.nist.gov"; // DNS-адрес NTP сервера time.nist.gov
const int NTP_PACKET_SIZE = 48;              // размер пакета 48 байт

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
// ПЕРЕМЕННЫЕ
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

unsigned int localPort = 2390;      // локальный порт для приёма UDP пакетов
IPAddress timeServerIP;             // IP-адрес NTP сервера time.nist.gov
byte packetBuffer[NTP_PACKET_SIZE]; // буфер для хранения принятых и исходящих пакетов
WiFiUDP udp;                        // экземпляр контроллера UDP для приёма/передачи UDP-пакетов

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                          ВСЕ ФУНКЦИИ ПРОЕКТА
// объявления
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

// ----------------------------------------------------------------------------
// контроль нажатия встроенной кнопки                                   ФУНКЦИЯ
// ----------------------------------------------------------------------------

void keypress();

