// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "esp8266_test"                                                                         --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (1) файл заголовок настроек проекта esp8266_test                                       --
// --                                                                                                    --
// --             (2) осуществляется ОДНОВРЕМЕННОЕ выполнение трёх потоков задач                         --
// --                                                                                                    --
// --                 BL (blink)    - непрерывная световая сигнализация                                  --
// --                 KP (keypress) - контроль нажатия встроенной кнопки                                 --
// --                 TS (timescan) - периодический вывод в UART значения времени                        --
// --                                                                                                    --
// --             (3) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                                                                                                    --
// --                         Arduino.h                                                                  --
// --                         ESP8266WiFi.h                                                              --
// --                         WiFiUdp.h                                                                  --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include <Arduino.h>
#include <ESP8266WiFi.h>
#include <WiFiUdp.h>

#define STASSID "TP-LINK_70CCF2"
#define STAPSK "19598932"

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
// КОНСТАНТЫ
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

const char *ssid = STASSID;                      // имя сети WIFI
const char *pass = STAPSK;                       // пароль сети WIFI
const char *ntpServerName = "time.nist.gov";     // DNS-адрес NTP сервера time.nist.gov
const int NTP_PACKET_SIZE = 48;                  // размер пакета 48 байт
const unsigned long seventyYears = 2208988800UL; // количество секунд в 70 годах
const unsigned long secsDay = 86400L;            // количество секунд в одном дне
const int serial1_led = 2;                       // светодиод. количество повторений серии 0 (30/600)
const int serial2_led = 2;                       // светодиод. количество повторений серии 1 (500/500)

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
// ПЕРЕМЕННЫЕ
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

unsigned int localPort = 2390; // контроллер NTP. локальный порт для приёма UDP пакетов
IPAddress timeServerIP;        // контроллер NTP. IP-адрес NTP сервера time.nist.gov
WiFiUDP udp;                   // контроллер NTP. экземпляр контроллера UDP для приёма/передачи UDP-пакетов
