// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "esp8266_blink"                                                                        --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (2) BL (blink) - это задача непрерывной световой сигнализации.                         --
// --                 для сигнализации используется единственный встроенный светодиод LED_BUILTIN.       --
// --                 бесконечно исполняемый цикл описывается таблицей                                   --
// --                                                                                                    --
// --                 BL01         20 мс           HIGH                                                  --
// --                 BL02         300 мс          LOW                                                   --
// --                 BL03         20 мс           HIGH                                                  --
// --                 BL04         300 мс          LOW                                                   --
// --                 BL05         500 мс          HIGH                                                  --
// --                 BL06         500 мс          LOW                                                   --
// --                 BL07         500 мс          HIGH                                                  --
// --                 BL08         500 мс          LOW                                                   --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include <Arduino.h>

#define SER1 2
#define SER2 2

class blink_led

{

public:
    // ------------------------------------------------------------------------------------
    //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
    // непрерывная световая сигнализация                                              blink
    // управление встроенным светодиодом LED_BUILTIN
    // ------------------------------------------------------------------------------------

    void run()

    {

        static uint32_t tmr;
        static bool mode = false; // светодиод. переключение серий (0 - 30/600, 1 - 500/500)
        static bool flag = false; // светодиод. только в серии 0. переключение интервалов
        static int count = 0;     // светодиод. счётчик повторений в серии

        if ((!mode && (count >= SER1)) || (mode && (count >= 1)))

        // ----------------------------------------------------------------------------
        // обновление настроек
        // при достижении счётчиком серии предельного значения
        // ----------------------------------------------------------------------------

        {
            mode = !mode;
            flag = false;
            count = 0;
        }
        else

            if (mode)

        // ----------------------------------------------------------------------------
        // серия 2
        // переключение состояния светодиода при mode_led = 1 (500/500)
        // ----------------------------------------------------------------------------

        {
            if (millis() - tmr >= 500)
            {
                digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
                tmr = millis();
                count++;
            }
        }

        else

        // ----------------------------------------------------------------------------
        // серия 1
        // переключение состояния светодиода при mode_led = 0 (30/600)
        // ----------------------------------------------------------------------------

        {
            if ((millis() - tmr) >= (flag ? 20 : 300))
            {
                digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
                tmr = millis();
                flag = !flag;
                count++;
            }
        }
    }

private:
};