// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "blink.cpp"                                                                            --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (1) blink.cpp - непрерывная световая сигнализация                                      --
// --                                                                                                    --
// --             (2) используется единственный встроенный светодиод LED_BUILTIN                         --
// --                                                                                                    --
// --                 бесконечно исполняемый цикл описывается таблицей                                   --
// --                 Интервал        LED_BUILTIN                                                        --
// --                 20 мс           HIGH                                                               --
// --                 300 мс          LOW                                                                --
// --                 20 мс           HIGH                                                               --
// --                 300 мс          LOW                                                                --
// --                 500 мс          HIGH                                                               --
// --                 500 мс          LOW                                                                --
// --                 500 мс          HIGH                                                               --
// --                 500 мс          LOW                                                                --
// --                                                                                                    --
// --             (3) ФАЙЛЫ, сопряжённые с проектом                                                      --
// --                 esp8266_test.h - заголовок, объявление функций и макроопределений проекта          --
// --                 main.cpp       - корневой исполняемый файл, содержит функции-процессы setup, loop  --
// --                 blink.cpp      - исполняемый файл, содержит функцию blink                          --
// --                 keypress.cpp   - исполняемый файл, содержит функцию keypress                       --
// --                 timescan.cpp   - исполняемый файл, содержит функцию timescan                       --
// --                                                                                                    --
// --             (4) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                                                                                                    --
// --             (5) МЕТОДЫ, которые вызываются из сопряжённых с проектом библиотек                     --
// --                 начальная настройка модуля UART                               Serial.begin         --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include "blink.h"

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                                      ФУНКЦИЯ
// непрерывная световая сигнализация                                      blink
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void blink()

{

  int i;

  for (i = 0;
       i < 2;
       i++)
  {

    digitalWrite(LED_BUILTIN, HIGH); // свечение LED_BUILTIN в режиме HIGH

    delay(20); // пауза 20 мсек

    digitalWrite(LED_BUILTIN, LOW); // свечение LED_BUILTIN в режиме LOW

    delay(300); // пауза 300 мсек
  }

  for (i = 0;
       i < 2;
       i++)
  {

    digitalWrite(LED_BUILTIN, HIGH); // свечение LED_BUILTIN в режиме HIGH

    delay(500); // пауза 500 мсек

    digitalWrite(LED_BUILTIN, LOW); // свечение LED_BUILTIN в режиме LOW

    delay(500); // пауза 500 мсек
  }

}

