// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "main"                                                                                 --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (1) осуществляется ОДНОВРЕМЕННОЕ выполнение трёх потоков задач                         --
// --                 каждому потоку задач соответствует отдельный ПРОЦЕСС                               --
// --                                                                                                    --
// --                 BL (blink)    - непрерывная световая сигнализация                                  --
// --                 KP (keypress) - контроль нажатия встроенной кнопки                                 --
// --                 TS (timescan) - периодический вывод в UART значения времени                        --
// --                                                                                                    --
// --             (2) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                                                                                                    --
// --                         Arduino.h                                                                  --
// --                         ESP8266WiFi.h                                                              --
// --                         WiFiUdp.h                                                                  --
// --                                                                                                    --
// --             (3) внешние методы, которые вызываются из сопряжённых с проектом классов               --
// --                                                                                                    --
// --                         Serial.begin          начальная настройка модуля UART                      --
// --                         Serial.println        вывод строки в UART                                  --
// --                         Serial.print          вывод символов в UART                                --
// --                         WiFi.begin            регистрация в сети WIFI                              --
// --                         WiFi.mode             начальная настройка модуля WIFI                      --
// --                         WiFi.status           состояние соединения WiFi                            --
// --                         WiFi.scanNetworks     поиск активных точек подключения WIFI                --
// --                         WiFi.hostByName       выбор IP адреса хоста по имени                       --
// --                         WiFi.disconnect       отключение модуля WIFI                               --
// --                         udp.begin             начало работы с протоколом UDP                       --
// --                         udp.read              чтение кадра UDP                                     --
// --                         udp.write             запись данных в кадр UDP                             --
// --                         udp.beginPacket       начало кадра UDP                                     --
// --                         udp.endPacket         конец кадра UDP                                      --
// --                         udp.parsePacket       синтаксический разбор кадра UDP                      --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include "esp8266_blink.h"
#include "esp8266_key.h"
#include "esp8266_timescan.h"
#include "esp8266_control.h"

#define BUTTON 15

blink_led BL;
key_press KP;
time_scan TS;
task_control<3> TC;

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА BLINK
// непрерывная световая сигнализация.
// ----------------------------------------------------------------------------

void blink()

{
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА KEYPRESS
// контроль нажатия встроенной кнопки.
// ----------------------------------------------------------------------------

void keypress()

{
}

// ----------------------------------------------------------------------------
//                                                                       ЗАДАЧА TIMESCAN
// периодический запрос точного времени на сервере NTP.
// ----------------------------------------------------------------------------

void ntp_time()

{

  TS.task_ts05();
  TS.task_ts07(TS.task_ts06());
}

void setup()

{

  pinMode(LED_BUILTIN, OUTPUT);  // светодиод. режим OUTPUT
  pinMode(BUTTON, INPUT_PULLUP); // кнопка. режим INPUT_PULLUP

  TC.attach(0, ntp_time, 3000);
  TC.attach(1, blink, 3000);
  TC.attach(2, keypress, 500);

  bool no_wifi = TS.task_ts02(TS.task_ts01());
  bool no_connect = TS.task_ts04(TS.task_ts03());

  if (no_wifi || no_connect)
    TC.stop(0);
}

void loop()

{

  TC.tick();
}
