// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ------------------------------------------------------------------------------------------------- module
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// --             "esp8266_test"                                                                         --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// ---------------------------------------------------------------------------------------------- component
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --                                                                                                    --
// --                                                                                                    --
// -- title       : esp8266_test                                                                         --
// -- version     : 2.0                                                                                  --
// -- framework   : arduino                                                                              --
// -- author      : goldobin a.                                                                          --
// -- company     : cardboard.ru                                                                         --
// -- data        : 08/09/2022                                                                           --
// --                                                                                                    --
// --                                                                                                    --
// -- description :                                                                                      --
// --                                                                                                    --
// --                                                                                                    --
// --             (1) осуществляется ОДНОВРЕМЕННОЕ выполнение трёх потоков задач                         --
// --                 каждому потоку задач соответствует отдельный ПРОЦЕСС                               --
// --                                                                                                    --
// --                 BL (blink)    - непрерывная световая сигнализация                                  --
// --                 KP (keypress) - контроль нажатия встроенной кнопки                                 --
// --                 TS (timescan) - периодический вывод в UART значения времени                        --
// --                                                                                                    --
// --             (2) BL (blink) - это ПРОЦЕСС непрерывной световой сигнализации.                        --
// --                 для сигнализации используется единственный встроенный светодиод LED_BUILTIN.       --
// --                 бесконечно исполняемый цикл описывается таблицей                                   --
// --                                                                                                    --
// --                 Задача       Интервал        LED_BUILTIN                                           --
// --                 BL01         20 мс           HIGH                                                  --
// --                 BL02         300 мс          LOW                                                   --
// --                 BL03         20 мс           HIGH                                                  --
// --                 BL04         300 мс          LOW                                                   --
// --                 BL05         500 мс          HIGH                                                  --
// --                 BL06         500 мс          LOW                                                   --
// --                 BL07         500 мс          HIGH                                                  --
// --                 BL08         500 мс          LOW                                                   --
// --                                                                                                    --
// --             (3) задача BL00 исполняются однократно.                                                --
// --                 поток задач BL01 .. BL08 исполняются непрерывно.                                   --
// --                 выполняется алгоритм                                                               --
// --                                                                                                    --
// --                                                                                                    --
// --                 (BL00) -> BL01, BL02, BL03, BL04, BL05, BL06, BL07, BL08                           --
// --                            |                                         |                             --
// --                            |<----------------------------------------|                             --
// --                                                                                                    --
// --                                                                                                    --
// --             (4) TS (timescan) - это ПРОЦЕСС периодического вывода в UART значения времени.         --
// --                 Клиент UDP/NTP. Считывание значения времени на сервере по протоколу NTP.           --
// --                 Обмен осуществляется с помощью сетевых пакетов UDP.                                --
// --                 Подробная справка о серверах времени NTP и необходимом формате сообщений           --
// --                 http://en.wikipedia.org/wiki/Network_Time_Protocol                                 --
// --                                                                                                    --
// --             (5) поток задач TS00 .. TS05 исполняются однократно.                                   --
// --                 поток задач TS06 .. TS19 исполняются непрерывно. через каждые 3 сек                --
// --                 выполняется алгоритм                                                               --
// --                                                                                                    --
// --
// -- (TS00, TS01, TS02, TS03, TS04, TS05) -> TS06, TS07, TS08, TS09, TS10, TS11, TS12, TS13, TS14, TS15, TS16, TS17, TS18, TS19 ->|
// --               |     |     |              |                       |                                                     |     |
// --               |<----|     |              |                       |---------------------------------------------------->|     |
// --               |           |              |                                                                                   |
// --               |---------->|              |<----------------------------------------------------------------------------------|
// --
// --                                                                                                    --
// --             (6) не следует явно указывать IP-адрес, иначе нет преимуществ пула.                    --
// --                 вместо этого указывается IP-адрес, соответстующий имени хоста.                     --
// --                 пример явного задания IP-адреса (NTP сервер time.nist.gov):                        --
// --                 IPAddress timeServer(129, 6, 15, 28);                                              --
// --                                                                                                    --
// --             (3) ВСТРОЕННАЯ КНОПКА "FLASH" используются для контроля нажатия.                       --
// --                 она подключена к земле GPIO0. её можно использовать как обычную кнопку.            --
// --                 если программно подтянуть вывод GPIO0 с помощью внутреннего подтягивающего         --
// --                 резистора к высокому уровню, то появление LOW на этом выводе означает НАЖАТИЕ.     --
// --                                                                                                    --
// --                 при коротком нажатии - в UART выводится строка "short"                             --
// --                 при долгом нажатии   - в UART выводится строка "long"                              --
// --                                                                                                    --
// --                 справка о полезном контакте контроллера/платы для кнопки "FLASH"                   --
// --                 15 (IO0, GPIO0, SPICS2) - в режиме INPUT_PULLUP                                    --
// --                                                                                                    --
// --             (5) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                 Arduino.h                                                                          --
// --                 ESP8266WiFi.h                                                                      --
// --                 WiFiUdp.h                                                                          --
// --                                                                                                    --
// --             (6) МЕТОДЫ, которые вызываются из сопряжённых с проектом библиотек                     --
// --                 начальная настройка модуля UART                               Serial.begin         --
// --                 передача пакета UDP                                           sendPacket           --
// --                 приём пакета UDP                                              ReceivePacket        --
// --                                                                                                    --
// --             (5) ФАЙЛЫ, сопряжённые с проектом                                                      --
// --                 esp8266_test.h - заголовок, объявление функций и макроопределений проекта          --
// --                 main.cpp       - корневой исполняемый файл, содержит функции-процессы setup, loop  --
// --                 blink.cpp      - исполняемый файл, содержит функцию blink                          --
// --                 keypress.cpp   - исполняемый файл, содержит функцию keypress                       --
// --                 timescan.cpp   - исполняемый файл, содержит функцию timescan                       --
// --                                                                                                    --
// --             (6) БИБЛИОТЕКИ, сопряжённые с проектом                                                 --
// --                                                                                                    --
// --             (7) МЕТОДЫ, которые вызываются из сопряжённых с проектом библиотек                     --
// --                 начальная настройка модуля UART                               Serial.begin         --
// --                                                                                                    --
// --                 вывод строки в UART                                           Serial.println       --
// --                 вывод символов в UART                                         Serial.print         --
// --                 начальная настройка модуля WIFI                               WiFi.mode            --
// --                 отключение модуля WIFI                                        WiFi.disconnect      --
// --                 поиск активных точек подключения WIFI                         WiFi.scanNetworks    --
// --                                                                                                    --
// --                                                                                                    --
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --
// --------------------------------------------------------------------------------------------------------
// -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- -- --

#include "esp8266_test.h"

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                             ФУНКЦИИ-ПРОЦЕССЫ
// бесконечное исполнение                                                 setup
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void setup()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени                                 timescan
  // включение UART, модуля WiFi. подключение к сети по UDP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// TS00
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // включение, настройка UART
  // начало печати отчёта
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  Serial.begin(9600);          // МЕТОД Serial.begin : скорость 9600 бод
  Serial.println();            // МЕТОД Serial.println
  Serial.println();            // МЕТОД Serial.println
  Serial.print("connect to "); // МЕТОД Serial.print
  Serial.println(ssid);        // МЕТОД Serial.println : значение SSID

  /////////////////////////////////////////////////////////////////////////////// TS01
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // включение модуля WIFI. режим station mode.
  // регистрация в сети WIFI
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  WiFi.mode(WIFI_STA);    // МЕТОД WiFi.mode  : режим station mode
  WiFi.begin(ssid, pass); // МЕТОД WiFi.begin : регистрация в сети WIFI

  /////////////////////////////////////////////////////////////////////////////// TS02
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // цикл опроса состояния соединения.
  // ПОКА состояние соединения != WL_CONNECTED: ТО пауза ожидания 500
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  while (WiFi.status() != WL_CONNECTED) // WiFi.status : состояние соединения

  {

    /////////////////////////////////////////////////////////////////////////////// TS03
    // ---------------------------------------------------------------------- delay 500
    //                                                                       ЗАДАЧА
    // пауза ожидания 50 мсек
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    delay(500);
    Serial.print("."); // МЕТОД Serial.print
  }

  /////////////////////////////////////////////////////////////////////////////// TS04
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // начало сеанса работы по протоколу UDP
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  udp.begin(localPort); // МЕТОД udp.begin

  /////////////////////////////////////////////////////////////////////////////// TS05
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // печать в UART отчёта.
  // информация о подключении к сети WIFI
  // информация о настройке протокола UDP
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  Serial.println("");               // МЕТОД Serial.println
  Serial.println("WIFI connected"); // МЕТОД Serial.println
  Serial.print("IP address: ");     // МЕТОД Serial.print
  Serial.println(WiFi.localIP());   // МЕТОД Serial.println, WiFi.localIP
  Serial.print("Local port: ");     // МЕТОД Serial.print
  Serial.println(udp.localPort());  // МЕТОД Serial.println, udp.localPort
  Serial.println("");               // МЕТОД Serial.println

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // начальная настройка контакта встроенного светодиода LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// BL00
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенного светодиода LED_BUILTIN
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(LED_BUILTIN, OUTPUT); // режим OUTPUT

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                       ОДНОКРАТНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // начальная настройка контакта встроенной кнопки FLASH
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //
  // (KP00) -> KP01, KP02, KP03, KP04, KP05, KP06, KP07, KP08
  //            |                                         |
  //            |-----------------------------------------|
  //
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// KP00
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  pinMode(15, INPUT_PULLUP); // режим INPUT_PULLUP
}

///////////////////////////////////////////////////////////////////////////////
// ----------------------------------------------------------------------------
//                                                             ФУНКЦИИ-ПРОЦЕССЫ
// бесконечное исполнение                                                  loop
// ----------------------------------------------------------------------------
///////////////////////////////////////////////////////////////////////////////

void loop()

{

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // периодический вывод в UART значения времени,                                timescan
  // полученного от сервера времени NTP
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// TS06
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // подключение к сети WIFI.
  // случайный выбор сервера NTP из пула
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  WiFi.hostByName(ntpServerName, timeServerIP); // МЕТОД WiFi.hostByName

  /////////////////////////////////////////////////////////////////////////////// TS07
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // начальная установка битовых полей пакета запроса времени NTP.
  // установка всех байтов буфера пакета в 0.
  // установка необходимых байтов буфера пакета.
  // байты 4 .. 11 (8 байтов) соответствуют полям Root Delay и Root Dispersion
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  memset(packetBuffer, 0, NTP_PACKET_SIZE);

  packetBuffer[0] = 0b11100011; // LI, версия, режим
  packetBuffer[1] = 0;          // уровень или тип часов
  packetBuffer[2] = 6;          // интервал
  packetBuffer[3] = 0xEC;       // точность (Peer Clock Precision)

  packetBuffer[12] = 49;
  packetBuffer[13] = 0x4E;
  packetBuffer[14] = 49;
  packetBuffer[15] = 52;

  /////////////////////////////////////////////////////////////////////////////// TS08
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // пакет запроса времени NTP сформирован.
  // отправка пакета NTP в выбранный сервер времени.
  // передача пакета в порт 123.
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  udp.beginPacket(timeServerIP, 123);       // МЕТОД udp.beginPacket
  udp.write(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.write
  udp.endPacket();                          // МЕТОД udp.endPacket

  /////////////////////////////////////////////////////////////////////////////// TS09
  // ---------------------------------------------------------------------- delay 1000
  //                                                                       ЗАДАЧА
  // ожидается ответ сервера на запрос
  // пауза ожидания ответа севера 100 мсек
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  //  delay(1000);

  /////////////////////////////////////////////////////////////////////////////// TS10
  // ----------------------------------------------------------------------------
  //                                                                       ЗАДАЧА
  // попытка разобрать пакет UDP
  // синтаксический разбор результата, полученного из сети WIFI.
  // ЕСЛИ длина пакета = 0 : ТО пакет UDP не принят
  // ЕСЛИ длина пакета != 0 : ТО пакет UDP получен
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  cb = udp.parsePacket(); // МЕТОД udp.parsePacket

  if (cb)

  {

    /////////////////////////////////////////////////////////////////////////////// TS11
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // сохранение полученного пакета в буфер
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    udp.read(packetBuffer, NTP_PACKET_SIZE); // МЕТОД udp.read

    /////////////////////////////////////////////////////////////////////////////// TS12
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // длина битового поля информации о времени равна четырем байтам (два слова).
    // начинается с 40-го байта принятого пакета.
    // старшее слово - байты 40 .. 41
    // младшее слов0 - байты 42 .. 43
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    highWord = word(packetBuffer[40], packetBuffer[41]);
    lowWord = word(packetBuffer[42], packetBuffer[43]);

    /////////////////////////////////////////////////////////////////////////////// TS13
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // время NTP. количество секунд, прошедших с даты Jan 1 1900
    // объединение четырех байтов в одно длинное целое число
    // время UNIX. количество секунд, прошедших с даты Jan 1 1970
    // вычитание из времени NTP количества секунд в 70 годах
    // время GMT+3. значение времени UNIX в Москве
    // прибавление к времени UNIX количества секунд в tdelta часах
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    secsSince1900 = highWord << 16 | lowWord;
    epoch = secsSince1900 - seventyYears;
    gmt3 = epoch + tdelta * 3600;

    /////////////////////////////////////////////////////////////////////////////// TS14
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о результатах расчёта времени
    // время GMT соответствует меридиану Гринвича (Greenwich Meridian time)
    // время GMT+3 соответствует текущему времени в Москве
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("packet length = "); // МЕТОД Serial.print
    Serial.println(cb);               // МЕТОД Serial.println
    Serial.print("NTP time   = ");    // МЕТОД Serial.print
    Serial.println(secsSince1900);    // МЕТОД Serial.println
    Serial.print("GMT time   = ");    // МЕТОД Serial.print
    Serial.println(epoch);            // МЕТОД Serial.println
    Serial.print("GMT+3 time = ");    // МЕТОД Serial.print
    Serial.println(gmt3);             // МЕТОД Serial.println

    /////////////////////////////////////////////////////////////////////////////// TS15
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // расчёт числа часов, минут, секунд времени GMT+3.
    // применяется формат HH:MM:SS
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    thrs = int((gmt3 % secsDay) / 3600);
    tmin = int((gmt3 % 3600) / 60);
    tsec = int(gmt3 % 60);

    /////////////////////////////////////////////////////////////////////////////// TS16
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве часов для времени GMT+3.
    // ЕСЛИ число часов < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    Serial.print("Moscow time is "); // МЕТОД Serial.print

    if (thrs < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(thrs); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS17
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве минут для времени GMT+3.
    // ЕСЛИ число минут < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tmin < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.print(tmin); // МЕТОД Serial.print
    Serial.print(':');  // МЕТОД Serial.print

    /////////////////////////////////////////////////////////////////////////////// TS18
    // ----------------------------------------------------------------------------
    //                                                                       ЗАДАЧА
    // печать в UART информации о количестве секунд для времени GMT+3.
    // ЕСЛИ число секунд < 10: ТО сначала необходимо напечатать '0'
    // ----------------------------------------------------------------------------
    ///////////////////////////////////////////////////////////////////////////////

    if (tsec < 10)

      Serial.print('0'); // МЕТОД Serial.print

    Serial.println(tsec); // МЕТОД Serial.println
    Serial.println();     // МЕТОД Serial.println
  }

  /////////////////////////////////////////////////////////////////////////////// TS19
  // ---------------------------------------------------------------------- delay 3000
  //                                                                       ЗАДАЧА
  // пауза ожидания 3 сек перед новым запросом времени
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  delay(3000);

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // непрерывная световая сигнализация                                              blink
  // управление встроенным светодиодом LED_BUILTIN
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------

  if (count_led >= serial1_led || count_led >= serial2_led)
  {
    mode_led = !mode_led;
    flag_led = false;
    count_led = 0;
  }
  else if (mode_led)
  {
    if (millis() - tmr_led >= 500)
    {
      digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
      tmr_led = millis();
      count_led++;
    }
  }
  else if ((millis() - tmr_led) >= (flag_led ? 20 : 300))
  {
    digitalWrite(LED_BUILTIN, !digitalRead(LED_BUILTIN));
    tmr_led = millis();
    flag_led = !flag_led;
    count_led++;
  }

  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //                                                        РЕГУЛЯРНО ИСПОЛНЯЕМЫЙ ПРОЦЕСС
  // контроль нажатия встроенной кнопки                                          keypress
  // опрос, обработка состояния встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////
  // ------------------------------------------------------------------------------------
  //
  // (KP00) -> KP01, KP02, KP03, KP04, KP05, KP06, KP07, KP08
  //            |                                         |
  //            |-----------------------------------------|
  //
  // ------------------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////////////

  /////////////////////////////////////////////////////////////////////////////// KP01
  // ----------------------------------------------------------------------------
  // начальная настройка
  // контакт встроенной кнопки FLASH (IO0, GPIO0, SPICS2) - 15
  // ----------------------------------------------------------------------------
  ///////////////////////////////////////////////////////////////////////////////

  keypress();
}
